Documents/СлужебнаяЗаписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СлужебнаяЗаписка</Name>
			<Comment>(Общ) Служебная записка</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаВозврат</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаВозврат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаВСмежнойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктаПриемкиТовараНаЭкспертизу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспертиза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоместо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЭтапыЭкспретизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЭтапыЭкспретизы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Одобрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленВФилиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СлужебнаяЗаписка/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	Если СокрЛП(Комментарий) = "" Тогда 
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнен Комментарий в документе", Отказ, Заголовок);
	КонецЕсли;	
	
	Если Экспертиза И ЗначениеЗаполнено(ЗаявкаНаВозврат) Тогда
		
		ЗаявкаНаВозвратОбъект = ЗаявкаНаВозврат.ПолучитьОбъект();
		
		БылиИзмененияЗаявкиНаВозврат = Ложь;
		
		Если Не ЗначениеЗаполнено(ЗаявкаНаВозврат.ДатаИзмененияЭтапаЭкспертизы) Тогда
			
			ЗаявкаНаВозвратОбъект.ДатаИзмененияЭтапаЭкспертизы = ТекущаяДата();
			БылиИзмененияЗаявкиНаВозврат = Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗаявкаНаВозврат.ЭтапЭкспертизы) Тогда
			
			ЗаявкаНаВозвратОбъект.ЭтапЭкспертизы = Перечисления.ЭтапыЭкспретизы.Подготовка;
			ЗаявкаНаВозвратОбъект.Статус         = "На экспертизе";
			
			Для Каждого СтрокаТовары Из ЗаявкаНаВозвратОбъект.Товары Цикл
				СтрокаТовары.Статус = "На экспертизе";
			КонецЦикла;
			
			БылиИзмененияЗаявкиНаВозврат = Истина;
			
		КонецЕсли;	
		
		Если Входящая И Погружено Тогда
						
			Если НЕ ЗаявкаНаВозврат.Статус = "Отказ в возврате" И НЕ ЗаявкаНаВозврат.ТребуетсяОтправкаТовараКлиенту Тогда
				
				ЗаявкаНаВозвратОбъект.Статус                         = "Отказ в возврате";
				ЗаявкаНаВозвратОбъект.ТребуетсяОтправкаТовараКлиенту = Истина;
				
				БылиИзмененияЗаявкиНаВозврат = Истина;
				
			КонецЕсли;
			
		КонецЕсли;		
		
		Если ЗаявкаНаВозврат.Реализация.Грузополучатель = Получатель И ЗаявкаНаВозврат.ТребуетсяОтправкаТовараКлиенту Тогда
			
			ЗаявкаНаВозвратОбъект.ТребуетсяОтправкаТовараКлиенту = Ложь;
			БылиИзмененияЗаявкиНаВозврат = Истина;

		КонецЕсли;		
		
		Если БылиИзмененияЗаявкиНаВозврат Тогда
			
			Попытка
				ЗаявкаНаВозвратОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Получатель) И Получатель = Получатель.ГоловнойКонтрагент Тогда		
		
		Отказ = Истина;
		Получатель = Неопределено;
		Сообщить("Выбранный контрагент не является грузополучателем.");
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат; 
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда 
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;       
		
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "СлужебнаяЗаписка" Тогда
		ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьСлужебнаяЗаписка(ЭтотОбъект.Ссылка);
	ИначеЕсли ИмяМакета = "Этикетки" Тогда	
		ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьЭтикеток(ЭтотОбъект.Ссылка);		
	ИначеЕсли ИмяМакета = "Этикетки60_40" Тогда	
		ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьЭтикеток(ЭтотОбъект.Ссылка,, "Этикетка60_40");
	ИначеЕсли ИмяМакета = "АктПриемаПередачиТоваров" Тогда
		  ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьАктаПриемаПередачи(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект),Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("СлужебнаяЗаписка", 	"Служебная записка");
	СтруктураМакетов.Вставить("Этикетки60_40", 		"Этикетки(60*40)");  
	СтруктураМакетов.Вставить("Этикетки", 			"Этикетки(100*60)"); 

	Если ЗначениеЗаполнено(ЗаявкаНаВозврат) Тогда
		СтруктураМакетов.Вставить("АктПриемаПередачиТоваров", "Акт приема передачи товаров");
	КонецЕсли;
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

Процедура ПриКопировании(ОбъектКопирования)
	
	Отправлен 	            = Ложь;  
	НомерИнвойс             = "";
	ЗаявкаНаВозврат         = Документы.ЗаявкаНаВозврат.ПустаяСсылка();
	ЗаданиеНаДоставку       = Документы.ЗаданиеНаДоставку.ПустаяСсылка();
	ИДДокументаВСмежнойБазе = ""; 
	Входящая                = Ложь;
	ТранспортныеЕдиницы.Очистить();
	
	Если ЗначениеЗаполнено(Получатель) И Получатель = Получатель.ГоловнойКонтрагент Тогда
		Получатель 			= Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВозврат") Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			ВызватьИсключение "Документ основание не проведен !"; 			
		КонецЕсли;
		
		СтатусТребуетсяЭкспертиза = Ложь;  
		ПолучательЭкспертизныхТоваров = Константы.ПолучательЭкспертизныхТоваров.Получить();
		
		Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
			
			Если СтрокаТабличнойЧасти.Тип = "Рекламация" И СтрокаТабличнойЧасти.Статус = "Требуется экспертиза" Тогда
				СтатусТребуетсяЭкспертиза = Истина;				
			КонецЕсли;			
			
			Если СтатусТребуетсяЭкспертиза Тогда   
				
				ЗаявкаНаВозврат = ДанныеЗаполнения.Ссылка;
				Экспертиза		= Истина;
				Получатель		= ПолучательЭкспертизныхТоваров;
				Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
				Комментарий     = "Передача на экспертизу поставщику : ";
				
				Для Каждого СтрокаТовары Из ЗаявкаНаВозврат.Товары Цикл
					
					Комментарий = Комментарий + Символы.ПС + СокрЛП(СтрокаТовары.Номенклатура.Артикул) + ", " 
												   		   + "'" + СокрЛП(СтрокаТовары.Номенклатура.Наименование) + "', "
														   + СокрЛП(СтрокаТовары.Номенклатура.Родитель.Наименование) + ", "
														   + СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + ", "
														   + "кол. " + СокрЛП(СтрокаТовары.Количество) + " шт., "
														   + "цена " + СокрЛП(СтрокаТовары.Цена)+ ", "
														   + "сумма " + СокрЛП(СтрокаТовары.Сумма);													   
					
				КонецЦикла;				
				
			Иначе
				ВызватьИсключение "Ввод служебной записки возможен только для документа с типом ""Рекламация"" и статусом ""Требуется экспертиза"" !"; 			
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	

КонецПроцедуры
